package com.task;

import Menu.MenuOptions;

import java.util.Scanner;

public class Main {
    /*Общие пояснения к практическому заданию.
    • В начале работы приложения данные должны считываться из файла, в конце
    работы – сохраняться в файл.
    • У пользователя должна быть возможность найти запись по любому параметру
    или по группе параметров (группу параметров можно определить
    самостоятельно), получить требуемые записи в отсортированном виде, найти
    записи, текстовое поле которой содержит определенное слово, а также
    добавить новую запись.
    • Особое условие: поиск, сравнение и валидацию вводимой информации
    осуществлять с использованием регулярных выражений.
    • Особое условие: проверку введенной информации на валидность должен
    осуществлять код, непосредственно добавляющий информацию.*/
    public static void main(String[] args) {
        Scanner input = new Scanner(System.in);
        MenuOptions menuOptions = new MenuOptions();

        menuOptions.renderMenu(input);
        input.close();
    }
}
