package com.task;

import Services.BookService;
import Services.UserService;

import java.util.Scanner;

public class Main {
    /*Задание 1: создать консольное приложение “Учет книг в домашней библиотеке”.
    Общие требования к заданию:
    • Система учитывает книги как в электронном, так и в бумажном варианте.
    • Существующие роли: пользователь, администратор.
    • Пользователь может просматривать книги в каталоге книг, осуществлять поиск
    книг в каталоге.
    • Администратор может модифицировать каталог.
    • *При добавлении описания книги в каталог оповещение о ней рассылается на
    e-mail всем пользователям
    • **При просмотре каталога желательно реализовать постраничный просмотр
    • ***Пользователь может предложить добавить книгу в библиотеку, переслав её
    администратору на e-mail.
    • Каталог книг хранится в текстовом файле.
    • Данные аутентификации пользователей хранятся в текстовом файле. Пароль
    не хранится в открытом виде*/
    public static void main(String[] args) {
        Scanner input = new Scanner(System.in);
        UserService userService = new UserService();
        BookService bookService = new BookService();

        userService.login();
        bookService.loadBooks();
        userService.renderMenu(input);
    }
}
